In [35]:
x = 10
print(x)
x += 2
print(x)

10
12

### Using Pandas
Let us open up our data.csv file using pandas

In [36]:
import pandas as pd

dataframe = pd.read_csv('./data/data.csv')

In [37]:
dataframe

        name   age sex
0      Alice  24.0   f
1        Bob  44.0   m
2  Chralotte  21.0   f
3     Daniel  36.0   m
4       Emma   NaN   f

In [38]:
dataframe.isnull()

    name    age    sex
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False   True  False

In [39]:
dataframe.isnull().sum()

name    0
age     1
sex     0
dtype: int64

In [40]:
dataframe.dtypes

name     object
age     float64
sex      object
dtype: object

In [41]:
mean_age = dataframe.age.mean()
mean_age

31.25

In [42]:
from math import floor

mean_age = floor(mean_age)
mean_age

31

In [43]:
dataframe.age.fillna(mean_age, inplace=True)

In [44]:
dataframe

        name   age sex
0      Alice  24.0   f
1        Bob  44.0   m
2  Chralotte  21.0   f
3     Daniel  36.0   m
4       Emma  31.0   f

In [45]:
dataframe.shape

(5, 3)

### Working with rows

In [46]:
dataframe.loc[1]

name     Bob
age     44.0
sex        m
Name: 1, dtype: object

In [47]:
dataframe.loc[[1, 2]]

        name   age sex
1        Bob  44.0   m
2  Chralotte  21.0   f

In [48]:
dataframe.loc[::-1]

        name   age sex
4       Emma  31.0   f
3     Daniel  36.0   m
2  Chralotte  21.0   f
1        Bob  44.0   m
0      Alice  24.0   f

### Read data from an online source

In [49]:
countries = pd.read_csv('https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv')

In [50]:
countries.head()

    Country  Region
0   Algeria  AFRICA
1    Angola  AFRICA
2     Benin  AFRICA
3  Botswana  AFRICA
4   Burkina  AFRICA

In [51]:
countries.tail()

       Country         Region
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

In [52]:
countries

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

### Read file from zip file

In [53]:
data = pd.read_csv('./data/data.zip')
data

        name   age sex
0      Alice  24.0   f
1        Bob  44.0   m
2  Chralotte  21.0   f
3     Daniel  36.0   m
4       Emma   NaN   f

In [54]:
dataframe

        name   age sex
0      Alice  24.0   f
1        Bob  44.0   m
2  Chralotte  21.0   f
3     Daniel  36.0   m
4       Emma  31.0   f